{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "MacroKeyboard",
			"Children": [
				{
					"Source": {
						"Text": " det"
					},
					"Translation": {
						"Text": " det"
					},
					"Key": "CapDetents"
				},
				{
					"Source": {
						"Text": " fr"
					},
					"Translation": {
						"Text": " fr"
					},
					"Key": "CapFrames"
				},
				{
					"Source": {
						"Text": "Action"
					},
					"Translation": {
						"Text": "Action"
					},
					"Key": "SectionAction"
				},
				{
					"Source": {
						"Text": "Action type"
					},
					"Translation": {
						"Text": "Action type"
					},
					"Key": "ActionLabel"
				},
				{
					"Source": {
						"Text": "All contexts (generic)"
					},
					"Translation": {
						"Text": "All contexts (generic)"
					},
					"Key": "ContextAll"
				},
				{
					"Source": {
						"Text": "Animation Blueprint"
					},
					"Translation": {
						"Text": "Animation Blueprint"
					},
					"Key": "ContextAnimBP"
				},
				{
					"Source": {
						"Text": "Animation Editor"
					},
					"Translation": {
						"Text": "Animation Editor"
					},
					"Key": "ContextAnim"
				},
				{
					"Source": {
						"Text": "Anticlockwise"
					},
					"Translation": {
						"Text": "Anticlockwise"
					},
					"Key": "LightDirCcw"
				},
				{
					"Source": {
						"Text": "Binding context"
					},
					"Translation": {
						"Text": "Binding context"
					},
					"Key": "CommandCtxLabel"
				},
				{
					"Source": {
						"Text": "Blocked"
					},
					"Translation": {
						"Text": "Blocked"
					},
					"Key": "CapBlocked"
				},
				{
					"Source": {
						"Text": "Breathing"
					},
					"Translation": {
						"Text": "Breathing"
					},
					"Key": "LightMode4"
				},
				{
					"Source": {
						"Text": "Brightness"
					},
					"Translation": {
						"Text": "Brightness"
					},
					"Key": "LightBright"
				},
				{
					"Source": {
						"Text": "Click a key on the pad to edit its binding; the backlight settings are on the right. The panel also opens as its own window from Window > Tools > MacroKeyboard."
					},
					"Translation": {
						"Text": "Click a key on the pad to edit its binding; the backlight settings are on the right. The panel also opens as its own window from Window > Tools > MacroKeyboard."
					},
					"Key": "PanelHint"
				},
				{
					"Source": {
						"Text": "Click a key, a knob zone or a joystick direction above to edit it; pressing a physical key highlights it."
					},
					"Translation": {
						"Text": "Click a key, a knob zone or a joystick direction above to edit it; pressing a physical key highlights it."
					},
					"Key": "PickControl"
				},
				{
					"Source": {
						"Text": "Click a key, a knob zone or a joystick direction to edit what it does in the current context."
					},
					"Translation": {
						"Text": "Click a key, a knob zone or a joystick direction to edit what it does in the current context."
					},
					"Key": "DeviceTip"
				},
				{
					"Source": {
						"Text": "Click to pick a colour"
					},
					"Translation": {
						"Text": "Click to pick a colour"
					},
					"Key": "LightColorTip"
				},
				{
					"Source": {
						"Text": "Click, then press the key combination"
					},
					"Translation": {
						"Text": "Click, then press the key combination"
					},
					"Key": "ChordTip"
				},
				{
					"Source": {
						"Text": "Clockwise"
					},
					"Translation": {
						"Text": "Clockwise"
					},
					"Key": "LightDirCw"
				},
				{
					"Source": {
						"Text": "Colour"
					},
					"Translation": {
						"Text": "Colour"
					},
					"Key": "LightColor"
				},
				{
					"Source": {
						"Text": "Command name"
					},
					"Translation": {
						"Text": "Command name"
					},
					"Key": "CommandNameLabel"
				},
				{
					"Source": {
						"Text": "Console command"
					},
					"Translation": {
						"Text": "Console command"
					},
					"Key": "ActionConsole"
				},
				{
					"Source": {
						"Text": "Console command"
					},
					"Translation": {
						"Text": "Console command"
					},
					"Key": "ConsoleLabel"
				},
				{
					"Source": {
						"Text": "Currently inherited from “All contexts”: {0}. Pick an action below to override it for this context only."
					},
					"Translation": {
						"Text": "Currently inherited from “All contexts”: {0}. Pick an action below to override it for this context only."
					},
					"Key": "InheritedFmt"
				},
				{
					"Source": {
						"Text": "Cycling breath"
					},
					"Translation": {
						"Text": "Cycling breath"
					},
					"Key": "LightMode5"
				},
				{
					"Source": {
						"Text": "Default: {0}"
					},
					"Translation": {
						"Text": "Default: {0}"
					},
					"Key": "DisplayNameHint"
				},
				{
					"Source": {
						"Text": "Detents per trigger"
					},
					"Translation": {
						"Text": "Detents per trigger"
					},
					"Key": "DetentsLabel"
				},
				{
					"Source": {
						"Text": "Direction"
					},
					"Translation": {
						"Text": "Direction"
					},
					"Key": "LightDir"
				},
				{
					"Source": {
						"Text": "Display name"
					},
					"Translation": {
						"Text": "Display name"
					},
					"Key": "DisplayNameLabel"
				},
				{
					"Source": {
						"Text": "Each click of the knob reports several steps (2 on the W909): 2 means one trigger per click."
					},
					"Translation": {
						"Text": "Each click of the knob reports several steps (2 on the W909): 2 means one trigger per click."
					},
					"Key": "DetentsTip"
				},
				{
					"Source": {
						"Text": "Editing context"
					},
					"Translation": {
						"Text": "Editing context"
					},
					"Key": "EditContext"
				},
				{
					"Source": {
						"Text": "Editor command (by name)"
					},
					"Translation": {
						"Text": "Editor command (by name)"
					},
					"Key": "ActionCommand"
				},
				{
					"Source": {
						"Text": "Editor shortcut"
					},
					"Translation": {
						"Text": "Editor shortcut"
					},
					"Key": "ActionChord"
				},
				{
					"Source": {
						"Text": "Flowing"
					},
					"Translation": {
						"Text": "Flowing"
					},
					"Key": "LightMode2"
				},
				{
					"Source": {
						"Text": "Follow editor"
					},
					"Translation": {
						"Text": "Follow editor"
					},
					"Key": "Follow"
				},
				{
					"Source": {
						"Text": "Frames per step"
					},
					"Translation": {
						"Text": "Frames per step"
					},
					"Key": "FramesLabel"
				},
				{
					"Source": {
						"Text": "Gives this context its own lighting, applied whenever it comes to the front"
					},
					"Translation": {
						"Text": "Gives this context its own lighting, applied whenever it comes to the front"
					},
					"Key": "LightPerContextTip"
				},
				{
					"Source": {
						"Text": "Hold-to-turn multiplier"
					},
					"Translation": {
						"Text": "Hold-to-turn multiplier"
					},
					"Key": "HoldAccel"
				},
				{
					"Source": {
						"Text": "In this context the knob press is the hold-to-accelerate modifier: its binding runs on release, and not at all if the knob was turned while held."
					},
					"Translation": {
						"Text": "In this context the knob press is the hold-to-accelerate modifier: its binding runs on release, and not at all if the knob was turned while held."
					},
					"Key": "KnobModifierNote"
				},
				{
					"Source": {
						"Text": "Joystick down"
					},
					"Translation": {
						"Text": "Joystick down"
					},
					"Key": "CtrlJoyDown"
				},
				{
					"Source": {
						"Text": "Joystick left"
					},
					"Translation": {
						"Text": "Joystick left"
					},
					"Key": "CtrlJoyLeft"
				},
				{
					"Source": {
						"Text": "Joystick press"
					},
					"Translation": {
						"Text": "Joystick press"
					},
					"Key": "CtrlJoyPress"
				},
				{
					"Source": {
						"Text": "Joystick right"
					},
					"Translation": {
						"Text": "Joystick right"
					},
					"Key": "CtrlJoyRight"
				},
				{
					"Source": {
						"Text": "Joystick up"
					},
					"Translation": {
						"Text": "Joystick up"
					},
					"Key": "CtrlJoyUp"
				},
				{
					"Source": {
						"Text": "Key settings"
					},
					"Translation": {
						"Text": "Key settings"
					},
					"Key": "BindingTitle"
				},
				{
					"Source": {
						"Text": "Knob"
					},
					"Translation": {
						"Text": "Knob"
					},
					"Key": "SectionKnob"
				},
				{
					"Source": {
						"Text": "Knob left"
					},
					"Translation": {
						"Text": "Knob left"
					},
					"Key": "CtrlKnobCcw"
				},
				{
					"Source": {
						"Text": "Knob press"
					},
					"Translation": {
						"Text": "Knob press"
					},
					"Key": "CtrlKnobPress"
				},
				{
					"Source": {
						"Text": "Knob right"
					},
					"Translation": {
						"Text": "Knob right"
					},
					"Key": "CtrlKnobCw"
				},
				{
					"Source": {
						"Text": "Level Editor"
					},
					"Translation": {
						"Text": "Level Editor"
					},
					"Key": "ContextLevel"
				},
				{
					"Source": {
						"Text": "Lighting for “{0}”"
					},
					"Translation": {
						"Text": "Lighting for “{0}”"
					},
					"Key": "LightOwnFmt"
				},
				{
					"Source": {
						"Text": "Macro pad"
					},
					"Translation": {
						"Text": "Macro pad"
					},
					"Key": "StatusLabel"
				},
				{
					"Source": {
						"Text": "Macro pad: MacroHub is connected but no pad was found\n{0}\nClick to open the setup panel"
					},
					"Translation": {
						"Text": "Macro pad: MacroHub is connected but no pad was found\n{0}\nClick to open the setup panel"
					},
					"Key": "StatusNoPad"
				},
				{
					"Source": {
						"Text": "Macro pad: MacroHub not connected (make sure MacroHub is running)\nClick to open the setup panel"
					},
					"Translation": {
						"Text": "Macro pad: MacroHub not connected (make sure MacroHub is running)\nClick to open the setup panel"
					},
					"Key": "StatusOff"
				},
				{
					"Source": {
						"Text": "Macro pad: connected\n{0}\nClick to open the setup panel"
					},
					"Translation": {
						"Text": "Macro pad: connected\n{0}\nClick to open the setup panel"
					},
					"Key": "StatusOn"
				},
				{
					"Source": {
						"Text": "Macro pad: set what each control does per editor context"
					},
					"Translation": {
						"Text": "Macro pad: set what each control does per editor context"
					},
					"Key": "PanelTooltip"
				},
				{
					"Source": {
						"Text": "MacroHub connected · pad not connected"
					},
					"Translation": {
						"Text": "MacroHub connected · pad not connected"
					},
					"Key": "PadOffline"
				},
				{
					"Source": {
						"Text": "MacroHub connected · pad online"
					},
					"Translation": {
						"Text": "MacroHub connected · pad online"
					},
					"Key": "PadOnline"
				},
				{
					"Source": {
						"Text": "MacroHub not connected"
					},
					"Translation": {
						"Text": "MacroHub not connected"
					},
					"Key": "HubOffline"
				},
				{
					"Source": {
						"Text": "MacroHub setup page"
					},
					"Translation": {
						"Text": "MacroHub setup page"
					},
					"Key": "OpenHub"
				},
				{
					"Source": {
						"Text": "MacroKeyboard"
					},
					"Translation": {
						"Text": "MacroKeyboard"
					},
					"Key": "PanelTitle"
				},
				{
					"Source": {
						"Text": "MacroKeyboard is not initialised"
					},
					"Translation": {
						"Text": "MacroKeyboard is not initialised"
					},
					"Key": "NoSubsystem"
				},
				{
					"Source": {
						"Text": "Marquee"
					},
					"Translation": {
						"Text": "Marquee"
					},
					"Key": "LightMode3"
				},
				{
					"Source": {
						"Text": "Mode"
					},
					"Translation": {
						"Text": "Mode"
					},
					"Key": "LightMode"
				},
				{
					"Source": {
						"Text": "Neon"
					},
					"Translation": {
						"Text": "Neon"
					},
					"Key": "LightMode7"
				},
				{
					"Source": {
						"Text": "None (block)"
					},
					"Translation": {
						"Text": "None (block)"
					},
					"Key": "ActionNone"
				},
				{
					"Source": {
						"Text": "Not taken over: MacroHub controls the backlight"
					},
					"Translation": {
						"Text": "Not taken over: MacroHub controls the backlight"
					},
					"Key": "LightOff"
				},
				{
					"Source": {
						"Text": "Off"
					},
					"Translation": {
						"Text": "Off"
					},
					"Key": "LightMode9"
				},
				{
					"Source": {
						"Text": "Open MacroHub’s device and forwarding settings in the browser"
					},
					"Translation": {
						"Text": "Open MacroHub’s device and forwarding settings in the browser"
					},
					"Key": "OpenHubTip"
				},
				{
					"Source": {
						"Text": "Open in its own window"
					},
					"Translation": {
						"Text": "Open in its own window"
					},
					"Key": "OpenPanelWindow"
				},
				{
					"Source": {
						"Text": "Open this panel as a separate editor window"
					},
					"Translation": {
						"Text": "Open this panel as a separate editor window"
					},
					"Key": "OpenPanelWindowTip"
				},
				{
					"Source": {
						"Text": "Pad lighting"
					},
					"Translation": {
						"Text": "Pad lighting"
					},
					"Key": "LightTitle"
				},
				{
					"Source": {
						"Text": "Per context"
					},
					"Translation": {
						"Text": "Per context"
					},
					"Key": "LightPerContext"
				},
				{
					"Source": {
						"Text": "Pick an action to create a binding for this context."
					},
					"Translation": {
						"Text": "Pick an action to create a binding for this context."
					},
					"Key": "PickAction"
				},
				{
					"Source": {
						"Text": "Play/Pause"
					},
					"Translation": {
						"Text": "Play/Pause"
					},
					"Key": "CapPlayPause"
				},
				{
					"Source": {
						"Text": "Playing in Editor"
					},
					"Translation": {
						"Text": "Playing in Editor"
					},
					"Key": "ContextPie"
				},
				{
					"Source": {
						"Text": "Rainbow flow"
					},
					"Translation": {
						"Text": "Rainbow flow"
					},
					"Key": "LightMode8"
				},
				{
					"Source": {
						"Text": "Remove binding"
					},
					"Translation": {
						"Text": "Remove binding"
					},
					"Key": "ClearBinding"
				},
				{
					"Source": {
						"Text": "Removes this context’s binding; if there is an “All contexts” binding, the control inherits it again"
					},
					"Translation": {
						"Text": "Removes this context’s binding; if there is an “All contexts” binding, the control inherits it again"
					},
					"Key": "ClearBindingTip"
				},
				{
					"Source": {
						"Text": "Replace every binding in every context with the plugin defaults? Your current bindings will be lost."
					},
					"Translation": {
						"Text": "Replace every binding in every context with the plugin defaults? Your current bindings will be lost."
					},
					"Key": "RestoreDefaultsConfirm"
				},
				{
					"Source": {
						"Text": "Replace every binding in every context with the plugin’s defaults"
					},
					"Translation": {
						"Text": "Replace every binding in every context with the plugin’s defaults"
					},
					"Key": "RestoreDefaultsTip"
				},
				{
					"Source": {
						"Text": "Restore default bindings…"
					},
					"Translation": {
						"Text": "Restore default bindings…"
					},
					"Key": "RestoreDefaults"
				},
				{
					"Source": {
						"Text": "Sequencer"
					},
					"Translation": {
						"Text": "Sequencer"
					},
					"Key": "ContextSequencer"
				},
				{
					"Source": {
						"Text": "Setup panel"
					},
					"Translation": {
						"Text": "Setup panel"
					},
					"Key": "PanelCategory"
				},
				{
					"Source": {
						"Text": "Shared by all contexts"
					},
					"Translation": {
						"Text": "Shared by all contexts"
					},
					"Key": "LightShared"
				},
				{
					"Source": {
						"Text": "Shortcut"
					},
					"Translation": {
						"Text": "Shortcut"
					},
					"Key": "ChordLabel"
				},
				{
					"Source": {
						"Text": "Simulate"
					},
					"Translation": {
						"Text": "Simulate"
					},
					"Key": "ContextSimulate"
				},
				{
					"Source": {
						"Text": "Solid"
					},
					"Translation": {
						"Text": "Solid"
					},
					"Key": "LightMode1"
				},
				{
					"Source": {
						"Text": "Speed"
					},
					"Translation": {
						"Text": "Speed"
					},
					"Key": "LightSpeed"
				},
				{
					"Source": {
						"Text": "Speed acceleration"
					},
					"Translation": {
						"Text": "Speed acceleration"
					},
					"Key": "KnobAccel"
				},
				{
					"Source": {
						"Text": "Take over"
					},
					"Translation": {
						"Text": "Take over"
					},
					"Key": "LightDrive"
				},
				{
					"Source": {
						"Text": "Tetris"
					},
					"Translation": {
						"Text": "Tetris"
					},
					"Key": "LightMode6"
				},
				{
					"Source": {
						"Text": "Text shown on the key cap instead of the action summary (such as the shortcut). Leave empty for the default. Only affects this binding in this context."
					},
					"Translation": {
						"Text": "Text shown on the key cap instead of the action summary (such as the shortcut). Leave empty for the default. Only affects this binding in this context."
					},
					"Key": "DisplayNameTip"
				},
				{
					"Source": {
						"Text": "The edited context follows the editor’s focus; untick to choose one yourself"
					},
					"Translation": {
						"Text": "The edited context follows the editor’s focus; untick to choose one yourself"
					},
					"Key": "FollowTip"
				},
				{
					"Source": {
						"Text": "Timeline play / pause"
					},
					"Translation": {
						"Text": "Timeline play / pause"
					},
					"Key": "ActionPlay"
				},
				{
					"Source": {
						"Text": "Timeline scrub"
					},
					"Translation": {
						"Text": "Timeline scrub"
					},
					"Key": "ActionScrub"
				},
				{
					"Source": {
						"Text": "Trigger"
					},
					"Translation": {
						"Text": "Trigger"
					},
					"Key": "SectionTrigger"
				},
				{
					"Source": {
						"Text": "Trigger on release (default: on press)"
					},
					"Translation": {
						"Text": "Trigger on release (default: on press)"
					},
					"Key": "OnRelease"
				},
				{
					"Source": {
						"Text": "Turning quickly moves further per step (×2 under 90 ms between steps, ×5 under 40 ms). Turn off when every click must be exactly one frame."
					},
					"Translation": {
						"Text": "Turning quickly moves further per step (×2 under 90 ms between steps, ×5 under 40 ms). Turn off when every click must be exactly one frame."
					},
					"Key": "KnobAccelTip"
				},
				{
					"Source": {
						"Text": "Turning while holding the knob down multiplies each step by this; releasing the knob goes straight back to normal. 1 = off.\nAbove 1, the knob press’s own binding in this context runs on release, and not at all if the knob was turned while held."
					},
					"Translation": {
						"Text": "Turning while holding the knob down multiplies each step by this; releasing the knob goes straight back to normal. 1 = off.\nAbove 1, the knob press’s own binding in this context runs on release, and not at all if the knob was turned while held."
					},
					"Key": "HoldAccelTip"
				},
				{
					"Source": {
						"Text": "Unbound"
					},
					"Translation": {
						"Text": "Unbound"
					},
					"Key": "Unbound"
				},
				{
					"Source": {
						"Text": "Waiting for MacroHub to send the pad layout… (make sure MacroHub is running)"
					},
					"Translation": {
						"Text": "Waiting for MacroHub to send the pad layout… (make sure MacroHub is running)"
					},
					"Key": "NoDevice"
				},
				{
					"Source": {
						"Text": "When on, the editor sets the pad’s backlight per context; when off, MacroHub controls it again"
					},
					"Translation": {
						"Text": "When on, the editor sets the pad’s backlight per context; when off, MacroHub controls it again"
					},
					"Key": "LightDriveTip"
				},
				{
					"Source": {
						"Text": "e.g. Sequencer"
					},
					"Translation": {
						"Text": "e.g. Sequencer"
					},
					"Key": "CommandCtxHint"
				},
				{
					"Source": {
						"Text": "e.g. TogglePlay"
					},
					"Translation": {
						"Text": "e.g. TogglePlay"
					},
					"Key": "CommandNameHint"
				},
				{
					"Source": {
						"Text": "e.g. stat fps"
					},
					"Translation": {
						"Text": "e.g. stat fps"
					},
					"Key": "ConsoleHint"
				},
				{
					"Source": {
						"Text": "in “{0}”"
					},
					"Translation": {
						"Text": "in “{0}”"
					},
					"Key": "EditingFmt"
				},
				{
					"Source": {
						"Text": "setup panel keyboard lighting"
					},
					"Translation": {
						"Text": "setup panel keyboard lighting"
					},
					"Key": "PanelRowFilter"
				},
				{
					"Source": {
						"Text": "{0} / 5"
					},
					"Translation": {
						"Text": "{0} / 5"
					},
					"Key": "LightSpeedFmt"
				},
				{
					"Source": {
						"Text": "{0} / 6"
					},
					"Translation": {
						"Text": "{0} / 6"
					},
					"Key": "LightBrightFmt"
				}
			]
		},
		{
			"Namespace": "UObjectCategory",
			"Children": [
				{
					"Source": {
						"Text": "Binding"
					},
					"Translation": {
						"Text": "Binding"
					},
					"Key": "Binding"
				},
				{
					"Source": {
						"Text": "Bindings"
					},
					"Translation": {
						"Text": "Bindings"
					},
					"Key": "Bindings"
				},
				{
					"Source": {
						"Text": "Connection"
					},
					"Translation": {
						"Text": "Connection"
					},
					"Key": "Connection"
				},
				{
					"Source": {
						"Text": "Diagnostics"
					},
					"Translation": {
						"Text": "Diagnostics"
					},
					"Key": "Diagnostics"
				},
				{
					"Source": {
						"Text": "Lighting"
					},
					"Translation": {
						"Text": "Lighting"
					},
					"Key": "Lighting"
				},
				{
					"Source": {
						"Text": "MacroKeyboard"
					},
					"Translation": {
						"Text": "MacroKeyboard"
					},
					"Key": "MacroKeyboard"
				}
			]
		},
		{
			"Namespace": "UObjectDisplayNames",
			"Children": [
				{
					"Source": {
						"Text": "Action"
					},
					"Translation": {
						"Text": "Action"
					},
					"Key": "MacroKeyboardBinding:Action"
				},
				{
					"Source": {
						"Text": "Amount"
					},
					"Translation": {
						"Text": "Amount"
					},
					"Key": "MacroKeyboardBinding:Amount"
				},
				{
					"Source": {
						"Text": "App Id"
					},
					"Translation": {
						"Text": "App Id"
					},
					"Key": "MacroKeyboardSettings:AppId"
				},
				{
					"Source": {
						"Text": "Bindings"
					},
					"Translation": {
						"Text": "Bindings"
					},
					"Key": "MacroKeyboardEditorSettings:Bindings"
				},
				{
					"Source": {
						"Text": "Brightness"
					},
					"Translation": {
						"Text": "Brightness"
					},
					"Key": "MacroLightingSpec:Brightness"
				},
				{
					"Source": {
						"Text": "Chord"
					},
					"Translation": {
						"Text": "Chord"
					},
					"Key": "EMacroEditorAction.Chord"
				},
				{
					"Source": {
						"Text": "Chord"
					},
					"Translation": {
						"Text": "Chord"
					},
					"Key": "MacroKeyboardBinding:Chord"
				},
				{
					"Source": {
						"Text": "Color"
					},
					"Translation": {
						"Text": "Color"
					},
					"Key": "MacroLightingSpec:Color"
				},
				{
					"Source": {
						"Text": "Command Context"
					},
					"Translation": {
						"Text": "Command Context"
					},
					"Key": "MacroKeyboardBinding:CommandContext"
				},
				{
					"Source": {
						"Text": "Command Name"
					},
					"Translation": {
						"Text": "Command Name"
					},
					"Key": "MacroKeyboardBinding:CommandName"
				},
				{
					"Source": {
						"Text": "Connected"
					},
					"Translation": {
						"Text": "Connected"
					},
					"Key": "EMacroHubConnection.Connected"
				},
				{
					"Source": {
						"Text": "Connecting"
					},
					"Translation": {
						"Text": "Connecting"
					},
					"Key": "EMacroHubConnection.Connecting"
				},
				{
					"Source": {
						"Text": "Console Command"
					},
					"Translation": {
						"Text": "Console Command"
					},
					"Key": "EMacroEditorAction.ConsoleCommand"
				},
				{
					"Source": {
						"Text": "Console Command"
					},
					"Translation": {
						"Text": "Console Command"
					},
					"Key": "MacroKeyboardBinding:ConsoleCommand"
				},
				{
					"Source": {
						"Text": "Context"
					},
					"Translation": {
						"Text": "Context"
					},
					"Key": "MacroContextLighting:Context"
				},
				{
					"Source": {
						"Text": "Context"
					},
					"Translation": {
						"Text": "Context"
					},
					"Key": "MacroKeyboardBinding:Context"
				},
				{
					"Source": {
						"Text": "Context Lighting"
					},
					"Translation": {
						"Text": "Context Lighting"
					},
					"Key": "MacroKeyboardEditorSettings:ContextLighting"
				},
				{
					"Source": {
						"Text": "Context Name"
					},
					"Translation": {
						"Text": "Context Name"
					},
					"Key": "MacroKeyboardSubsystem:ReportContext:ContextName"
				},
				{
					"Source": {
						"Text": "Control"
					},
					"Translation": {
						"Text": "Control"
					},
					"Key": "MacroControlEvent:Control"
				},
				{
					"Source": {
						"Text": "Control"
					},
					"Translation": {
						"Text": "Control"
					},
					"Key": "MacroKeyboardBinding:Control"
				},
				{
					"Source": {
						"Text": "Detail"
					},
					"Translation": {
						"Text": "Detail"
					},
					"Key": "MacroKeyboardSubsystem:ReportContext:Detail"
				},
				{
					"Source": {
						"Text": "Detents Per Trigger"
					},
					"Translation": {
						"Text": "Detents Per Trigger"
					},
					"Key": "MacroKeyboardBinding:DetentsPerTrigger"
				},
				{
					"Source": {
						"Text": "Direction"
					},
					"Translation": {
						"Text": "Direction"
					},
					"Key": "MacroLightingSpec:Direction"
				},
				{
					"Source": {
						"Text": "Disabled"
					},
					"Translation": {
						"Text": "Disabled"
					},
					"Key": "EMacroHubConnection.Disabled"
				},
				{
					"Source": {
						"Text": "Display Name"
					},
					"Translation": {
						"Text": "Display Name"
					},
					"Key": "MacroKeyboardBinding:DisplayName"
				},
				{
					"Source": {
						"Text": "Down"
					},
					"Translation": {
						"Text": "Down"
					},
					"Key": "EMacroControlPhase.Down"
				},
				{
					"Source": {
						"Text": "Drive Lighting"
					},
					"Translation": {
						"Text": "Drive Lighting"
					},
					"Key": "MacroKeyboardEditorSettings:bDriveLighting"
				},
				{
					"Source": {
						"Text": "EMacro Control Phase MAX"
					},
					"Translation": {
						"Text": "EMacro Control Phase MAX"
					},
					"Key": "EMacroControlPhase.EMacroControlPhase_MAX"
				},
				{
					"Source": {
						"Text": "EMacro Editor Action MAX"
					},
					"Translation": {
						"Text": "EMacro Editor Action MAX"
					},
					"Key": "EMacroEditorAction.EMacroEditorAction_MAX"
				},
				{
					"Source": {
						"Text": "EMacro Hub Connection MAX"
					},
					"Translation": {
						"Text": "EMacro Hub Connection MAX"
					},
					"Key": "EMacroHubConnection.EMacroHubConnection_MAX"
				},
				{
					"Source": {
						"Text": "Enabled"
					},
					"Translation": {
						"Text": "Enabled"
					},
					"Key": "MacroKeyboardSettings:bEnabled"
				},
				{
					"Source": {
						"Text": "Event"
					},
					"Translation": {
						"Text": "Event"
					},
					"Key": "OnMacroControlEventBP__DelegateSignature:Event"
				},
				{
					"Source": {
						"Text": "Hold Multiplier"
					},
					"Translation": {
						"Text": "Hold Multiplier"
					},
					"Key": "MacroKeyboardBinding:HoldMultiplier"
				},
				{
					"Source": {
						"Text": "Id"
					},
					"Translation": {
						"Text": "Id"
					},
					"Key": "MacroControlInfo:Id"
				},
				{
					"Source": {
						"Text": "Kind"
					},
					"Translation": {
						"Text": "Kind"
					},
					"Key": "MacroControlEvent:Kind"
				},
				{
					"Source": {
						"Text": "Kind"
					},
					"Translation": {
						"Text": "Kind"
					},
					"Key": "MacroControlInfo:Kind"
				},
				{
					"Source": {
						"Text": "Label"
					},
					"Translation": {
						"Text": "Label"
					},
					"Key": "MacroControlInfo:Label"
				},
				{
					"Source": {
						"Text": "Lighting"
					},
					"Translation": {
						"Text": "Lighting"
					},
					"Key": "MacroContextLighting:Lighting"
				},
				{
					"Source": {
						"Text": "Log Control Events"
					},
					"Translation": {
						"Text": "Log Control Events"
					},
					"Key": "MacroKeyboardEditorSettings:bLogControlEvents"
				},
				{
					"Source": {
						"Text": "Log Raw Hub Events"
					},
					"Translation": {
						"Text": "Log Raw Hub Events"
					},
					"Key": "MacroKeyboardSettings:bLogEvents"
				},
				{
					"Source": {
						"Text": "Macro Context Lighting"
					},
					"Translation": {
						"Text": "Macro Context Lighting"
					},
					"Key": "MacroContextLighting"
				},
				{
					"Source": {
						"Text": "Macro Control Event"
					},
					"Translation": {
						"Text": "Macro Control Event"
					},
					"Key": "MacroControlEvent"
				},
				{
					"Source": {
						"Text": "Macro Control Info"
					},
					"Translation": {
						"Text": "Macro Control Info"
					},
					"Key": "MacroControlInfo"
				},
				{
					"Source": {
						"Text": "Macro Keyboard Binding"
					},
					"Translation": {
						"Text": "Macro Keyboard Binding"
					},
					"Key": "MacroKeyboardBinding"
				},
				{
					"Source": {
						"Text": "Macro Keyboard Subsystem"
					},
					"Translation": {
						"Text": "Macro Keyboard Subsystem"
					},
					"Key": "MacroKeyboardSubsystem"
				},
				{
					"Source": {
						"Text": "Macro Lighting Spec"
					},
					"Translation": {
						"Text": "Macro Lighting Spec"
					},
					"Key": "MacroLightingSpec"
				},
				{
					"Source": {
						"Text": "MacroKeyboard"
					},
					"Translation": {
						"Text": "MacroKeyboard"
					},
					"Key": "MacroKeyboardSettings"
				},
				{
					"Source": {
						"Text": "MacroKeyboard (Editor)"
					},
					"Translation": {
						"Text": "MacroKeyboard (Editor)"
					},
					"Key": "MacroKeyboardEditorSettings"
				},
				{
					"Source": {
						"Text": "Mode"
					},
					"Translation": {
						"Text": "Mode"
					},
					"Key": "MacroLightingSpec:Mode"
				},
				{
					"Source": {
						"Text": "None"
					},
					"Translation": {
						"Text": "None"
					},
					"Key": "EMacroEditorAction.None"
				},
				{
					"Source": {
						"Text": "On Control Event BP"
					},
					"Translation": {
						"Text": "On Control Event BP"
					},
					"Key": "MacroKeyboardSubsystem:OnControlEventBP"
				},
				{
					"Source": {
						"Text": "On Release"
					},
					"Translation": {
						"Text": "On Release"
					},
					"Key": "MacroKeyboardBinding:bOnRelease"
				},
				{
					"Source": {
						"Text": "Part"
					},
					"Translation": {
						"Text": "Part"
					},
					"Key": "MacroControlEvent:Part"
				},
				{
					"Source": {
						"Text": "Part"
					},
					"Translation": {
						"Text": "Part"
					},
					"Key": "MacroControlInfo:Part"
				},
				{
					"Source": {
						"Text": "Phase"
					},
					"Translation": {
						"Text": "Phase"
					},
					"Key": "MacroControlEvent:Phase"
				},
				{
					"Source": {
						"Text": "Pipe Name"
					},
					"Translation": {
						"Text": "Pipe Name"
					},
					"Key": "MacroKeyboardSettings:PipeName"
				},
				{
					"Source": {
						"Text": "Reconnect Seconds"
					},
					"Translation": {
						"Text": "Reconnect Seconds"
					},
					"Key": "MacroKeyboardSettings:ReconnectSeconds"
				},
				{
					"Source": {
						"Text": "Rect"
					},
					"Translation": {
						"Text": "Rect"
					},
					"Key": "MacroControlInfo:Rect"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "MacroKeyboardSubsystem:DescribeConnection:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "MacroKeyboardSubsystem:GetConnectionState:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "MacroKeyboardSubsystem:GetControls:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "MacroKeyboardSubsystem:GetReportedContext:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "MacroKeyboardSubsystem:IsConnected:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "MacroKeyboardSubsystem:IsPadConnected:ReturnValue"
				},
				{
					"Source": {
						"Text": "Seq"
					},
					"Translation": {
						"Text": "Seq"
					},
					"Key": "MacroControlEvent:Seq"
				},
				{
					"Source": {
						"Text": "Source"
					},
					"Translation": {
						"Text": "Source"
					},
					"Key": "MacroControlEvent:Source"
				},
				{
					"Source": {
						"Text": "Spec"
					},
					"Translation": {
						"Text": "Spec"
					},
					"Key": "MacroKeyboardSubsystem:SetLighting:Spec"
				},
				{
					"Source": {
						"Text": "Speed"
					},
					"Translation": {
						"Text": "Speed"
					},
					"Key": "MacroLightingSpec:Speed"
				},
				{
					"Source": {
						"Text": "Speed Acceleration"
					},
					"Translation": {
						"Text": "Speed Acceleration"
					},
					"Key": "MacroKeyboardBinding:bSpeedAcceleration"
				},
				{
					"Source": {
						"Text": "Timeline Play Pause"
					},
					"Translation": {
						"Text": "Timeline Play Pause"
					},
					"Key": "EMacroEditorAction.TimelinePlayPause"
				},
				{
					"Source": {
						"Text": "Timeline Scrub"
					},
					"Translation": {
						"Text": "Timeline Scrub"
					},
					"Key": "EMacroEditorAction.TimelineScrub"
				},
				{
					"Source": {
						"Text": "Timestamp Ms"
					},
					"Translation": {
						"Text": "Timestamp Ms"
					},
					"Key": "MacroControlEvent:TimestampMs"
				},
				{
					"Source": {
						"Text": "UICommand"
					},
					"Translation": {
						"Text": "UICommand"
					},
					"Key": "EMacroEditorAction.UICommand"
				},
				{
					"Source": {
						"Text": "Up"
					},
					"Translation": {
						"Text": "Up"
					},
					"Key": "EMacroControlPhase.Up"
				}
			]
		},
		{
			"Namespace": "UObjectToolTips",
			"Children": [
				{
					"Source": {
						"Text": "\"key\", \"knob\" or \"joystick\"."
					},
					"Translation": {
						"Text": "\"key\", \"knob\" or \"joystick\"."
					},
					"Key": "MacroControlEvent:Kind"
				},
				{
					"Source": {
						"Text": "\"key\", \"knob\" or \"joystick\"."
					},
					"Translation": {
						"Text": "\"key\", \"knob\" or \"joystick\"."
					},
					"Key": "MacroControlInfo:Kind"
				},
				{
					"Source": {
						"Text": "\"pad\" for the physical device, \"simulate\" for the Hub's web UI / tests."
					},
					"Translation": {
						"Text": "\"pad\" for the physical device, \"simulate\" for the Hub's web UI / tests."
					},
					"Key": "MacroControlEvent:Source"
				},
				{
					"Source": {
						"Text": "0 (slowest) to 5 (fastest); only the animated effects use it."
					},
					"Translation": {
						"Text": "0 (slowest) to 5 (fastest); only the animated effects use it."
					},
					"Key": "MacroLightingSpec:Speed"
				},
				{
					"Source": {
						"Text": "0 or 1; only the flowing effects use it."
					},
					"Translation": {
						"Text": "0 or 1; only the flowing effects use it."
					},
					"Key": "MacroLightingSpec:Direction"
				},
				{
					"Source": {
						"Text": "1 (dimmest) to 6 (brightest)."
					},
					"Translation": {
						"Text": "1 (dimmest) to 6 (brightest)."
					},
					"Key": "MacroLightingSpec:Brightness"
				},
				{
					"Source": {
						"Text": "A control as described by MacroHub (welcome / profile message): what it is called and where it sits on the device,\nso a UI can draw the pad without knowing the hardware."
					},
					"Translation": {
						"Text": "A control as described by MacroHub (welcome / profile message): what it is called and where it sits on the device,\nso a UI can draw the pad without knowing the hardware."
					},
					"Key": "MacroControlInfo"
				},
				{
					"Source": {
						"Text": "Backlight state of the pad, mirroring what MacroHub's own lighting panel offers. The Hub clamps anything out of\nrange, so these are the values the firmware actually has."
					},
					"Translation": {
						"Text": "Backlight state of the pad, mirroring what MacroHub's own lighting panel offers. The Hub clamps anything out of\nrange, so these are the values the firmware actually has."
					},
					"Key": "MacroLightingSpec"
				},
				{
					"Source": {
						"Text": "Backlight to apply while a given editor context is in front."
					},
					"Translation": {
						"Text": "Backlight to apply while a given editor context is in front."
					},
					"Key": "MacroContextLighting"
				},
				{
					"Source": {
						"Text": "Binding context of the command, e.g. \"LevelEditor\", \"Sequencer\" (Action = UICommand)."
					},
					"Translation": {
						"Text": "Binding context of the command, e.g. \"LevelEditor\", \"Sequencer\" (Action = UICommand)."
					},
					"Key": "MacroKeyboardBinding:CommandContext"
				},
				{
					"Source": {
						"Text": "Blueprint listeners."
					},
					"Translation": {
						"Text": "Blueprint listeners."
					},
					"Key": "MacroKeyboardSubsystem:OnControlEventBP"
				},
				{
					"Source": {
						"Text": "Command name inside that context, e.g. \"Undo\" (Action = UICommand)."
					},
					"Translation": {
						"Text": "Command name inside that context, e.g. \"Undo\" (Action = UICommand)."
					},
					"Key": "MacroKeyboardBinding:CommandName"
				},
				{
					"Source": {
						"Text": "Connect to MacroHub. Turn off to leave the pad to MacroHub's own shortcut layers."
					},
					"Translation": {
						"Text": "Connect to MacroHub. Turn off to leave the pad to MacroHub's own shortcut layers."
					},
					"Key": "MacroKeyboardSettings:bEnabled"
				},
				{
					"Source": {
						"Text": "Connection state of the MacroHub client."
					},
					"Translation": {
						"Text": "Connection state of the MacroHub client."
					},
					"Key": "EMacroHubConnection"
				},
				{
					"Source": {
						"Text": "Console / editor command (Action = ConsoleCommand)."
					},
					"Translation": {
						"Text": "Console / editor command (Action = ConsoleCommand)."
					},
					"Key": "MacroKeyboardBinding:ConsoleCommand"
				},
				{
					"Source": {
						"Text": "Context id reported by the plugin: levelEditor, sequencer, animation, animBlueprint, pie, simulate, editor…"
					},
					"Translation": {
						"Text": "Context id reported by the plugin: levelEditor, sequencer, animation, animBlueprint, pie, simulate, editor…"
					},
					"Key": "MacroKeyboardBinding:Context"
				},
				{
					"Source": {
						"Text": "Context id; empty applies to every context that has none of its own."
					},
					"Translation": {
						"Text": "Context id; empty applies to every context that has none of its own."
					},
					"Key": "MacroContextLighting:Context"
				},
				{
					"Source": {
						"Text": "Control id from MacroHub: K1…K9, K0, KDOT, KENTER, KMINUS, KPLUS, KSPACE, KNOB_CW/CCW/PRESS, JOY_*."
					},
					"Translation": {
						"Text": "Control id from MacroHub: K1…K9, K0, KDOT, KENTER, KMINUS, KPLUS, KSPACE, KNOB_CW/CCW/PRESS, JOY_*."
					},
					"Key": "MacroKeyboardBinding:Control"
				},
				{
					"Source": {
						"Text": "Detents per trigger for a rotary control: the pad reports several steps per physical click, so 3 here means\none click moves the timeline once. 1 acts on every step."
					},
					"Translation": {
						"Text": "Detents per trigger for a rotary control: the pad reports several steps per physical click, so 3 here means\none click moves the timeline once. 1 acts on every step."
					},
					"Key": "MacroKeyboardBinding:DetentsPerTrigger"
				},
				{
					"Source": {
						"Text": "Editor Preferences → Plugins → MacroKeyboard (Editor): which control does what in which editor."
					},
					"Translation": {
						"Text": "Editor Preferences → Plugins → MacroKeyboard (Editor): which control does what in which editor."
					},
					"Key": "MacroKeyboardEditorSettings"
				},
				{
					"Source": {
						"Text": "Effect: 1 Solid · 2 Flowing · 3 Marquee · 4 Breathing · 5 Cycling breath · 6 Tetris · 7 Neon · 8 Rainbow flow · 9 Off"
					},
					"Translation": {
						"Text": "Effect: 1 Solid · 2 Flowing · 3 Marquee · 4 Breathing · 5 Cycling breath · 6 Tetris · 7 Neon · 8 Rainbow flow · 9 Off"
					},
					"Key": "MacroLightingSpec:Mode"
				},
				{
					"Source": {
						"Text": "Execute a console / editor command, e.g. \"stat fps\"."
					},
					"Translation": {
						"Text": "Execute a console / editor command, e.g. \"stat fps\"."
					},
					"Key": "EMacroEditorAction.ConsoleCommand"
				},
				{
					"Source": {
						"Text": "Frames per trigger; rotary controls use the direction of the turn (Action = TimelineScrub)."
					},
					"Translation": {
						"Text": "Frames per trigger; rotary controls use the direction of the turn (Action = TimelineScrub)."
					},
					"Key": "MacroKeyboardBinding:Amount"
				},
				{
					"Source": {
						"Text": "Hub monotonic timestamp in milliseconds — use the delta between detents for knob acceleration."
					},
					"Translation": {
						"Text": "Hub monotonic timestamp in milliseconds — use the delta between detents for knob acceleration."
					},
					"Key": "MacroControlEvent:TimestampMs"
				},
				{
					"Source": {
						"Text": "Identifies this client in MacroHub's web UI."
					},
					"Translation": {
						"Text": "Identifies this client in MacroHub's web UI."
					},
					"Key": "MacroKeyboardSettings:AppId"
				},
				{
					"Source": {
						"Text": "Layout rectangle in key-width units: position and size on the device."
					},
					"Translation": {
						"Text": "Layout rectangle in key-width units: position and size on the device."
					},
					"Key": "MacroControlInfo:Rect"
				},
				{
					"Source": {
						"Text": "Let the editor tint the pad: each context below gets its own backlight while it is in front."
					},
					"Translation": {
						"Text": "Let the editor tint the pad: each context below gets its own backlight while it is in front."
					},
					"Key": "MacroKeyboardEditorSettings:bDriveLighting"
				},
				{
					"Source": {
						"Text": "Logical control id, e.g. \"K1\", \"KNOB_CW\", \"JOY_PRESS\"."
					},
					"Translation": {
						"Text": "Logical control id, e.g. \"K1\", \"KNOB_CW\", \"JOY_PRESS\"."
					},
					"Key": "MacroControlEvent:Control"
				},
				{
					"Source": {
						"Text": "Look the shortcut up by command name and send it — survives users rebinding the command."
					},
					"Translation": {
						"Text": "Look the shortcut up by command name and send it — survives users rebinding the command."
					},
					"Key": "EMacroEditorAction.UICommand"
				},
				{
					"Source": {
						"Text": "Move the Sequencer playhead / animation preview time. Rotary controls scrub by their turn direction."
					},
					"Translation": {
						"Text": "Move the Sequencer playhead / animation preview time. Rotary controls scrub by their turn direction."
					},
					"Key": "EMacroEditorAction.TimelineScrub"
				},
				{
					"Source": {
						"Text": "Name shown on the key cap in the MacroKeyboard panel; empty shows the action itself (e.g. the shortcut)."
					},
					"Translation": {
						"Text": "Name shown on the key cap in the MacroKeyboard panel; empty shows the action itself (e.g. the shortcut)."
					},
					"Key": "MacroKeyboardBinding:DisplayName"
				},
				{
					"Source": {
						"Text": "Named pipe published by MacroHub (its --pipe argument), without the \\\\.\\pipe\\ prefix."
					},
					"Translation": {
						"Text": "Named pipe published by MacroHub (its --pipe argument), without the \\\\.\\pipe\\ prefix."
					},
					"Key": "MacroKeyboardSettings:PipeName"
				},
				{
					"Source": {
						"Text": "Nothing (use to shadow a broader binding in one context)."
					},
					"Translation": {
						"Text": "Nothing (use to shadow a broader binding in one context)."
					},
					"Key": "EMacroEditorAction.None"
				},
				{
					"Source": {
						"Text": "One binding: \"in this context, this control does this\".\nContext matching is exact; leave it empty to apply in every context that has no more specific binding."
					},
					"Translation": {
						"Text": "One binding: \"in this context, this control does this\".\nContext matching is exact; leave it empty to apply in every context that has no more specific binding."
					},
					"Key": "MacroKeyboardBinding"
				},
				{
					"Source": {
						"Text": "One control event as sent by MacroHub (protocol v2, \"control\" message).\nControl ids come from the Hub's device map, e.g. K1, KNOB_CW, JOY_UP."
					},
					"Translation": {
						"Text": "One control event as sent by MacroHub (protocol v2, \"control\" message).\nControl ids come from the Hub's device map, e.g. K1, KNOB_CW, JOY_UP."
					},
					"Key": "MacroControlEvent"
				},
				{
					"Source": {
						"Text": "Owns the MacroHub connection and delivers control events on the game thread.\n\nLives in the editor and in game builds; the editor module adds context detection and editor actions on top.\nEvents arrive on a background thread and are drained once per frame, so handlers run at a predictable point."
					},
					"Translation": {
						"Text": "Owns the MacroHub connection and delivers control events on the game thread.\n\nLives in the editor and in game builds; the editor module adds context detection and editor actions on top.\nEvents arrive on a background thread and are drained once per frame, so handlers run at a predictable point."
					},
					"Key": "MacroKeyboardSubsystem"
				},
				{
					"Source": {
						"Text": "Per-connection sequence number; a gap means the game thread stalled and the Hub dropped queued events."
					},
					"Translation": {
						"Text": "Per-connection sequence number; a gap means the game thread stalled and the Hub dropped queued events."
					},
					"Key": "MacroControlEvent:Seq"
				},
				{
					"Source": {
						"Text": "Play or pause the Sequencer / animation preview."
					},
					"Translation": {
						"Text": "Play or pause the Sequencer / animation preview."
					},
					"Key": "EMacroEditorAction.TimelinePlayPause"
				},
				{
					"Source": {
						"Text": "Press or release of a control. Rotary controls send one Down/Up pair per detent."
					},
					"Translation": {
						"Text": "Press or release of a control. Rotary controls send one Down/Up pair per detent."
					},
					"Key": "EMacroControlPhase"
				},
				{
					"Source": {
						"Text": "Project Settings → Plugins → MacroKeyboard."
					},
					"Translation": {
						"Text": "Project Settings → Plugins → MacroKeyboard."
					},
					"Key": "MacroKeyboardSettings"
				},
				{
					"Source": {
						"Text": "Rotary controls: how much further a detent moves while the knob is held down during the turn. 1 turns it off.\nWhen a context uses it, the knob press becomes a modifier there and its own binding runs as a click on release."
					},
					"Translation": {
						"Text": "Rotary controls: how much further a detent moves while the knob is held down during the turn. 1 turns it off.\nWhen a context uses it, the knob press becomes a modifier there and its own binding runs as a click on release."
					},
					"Key": "MacroKeyboardBinding:HoldMultiplier"
				},
				{
					"Source": {
						"Text": "Rotary controls: turning quickly moves further per detent (2x under 90 ms, 5x under 40 ms between detents)."
					},
					"Translation": {
						"Text": "Rotary controls: turning quickly moves further per detent (2x under 90 ms, 5x under 40 ms between detents)."
					},
					"Key": "MacroKeyboardBinding:bSpeedAcceleration"
				},
				{
					"Source": {
						"Text": "Run on release instead of press."
					},
					"Translation": {
						"Text": "Run on release instead of press."
					},
					"Key": "MacroKeyboardBinding:bOnRelease"
				},
				{
					"Source": {
						"Text": "Seconds between reconnect attempts while MacroHub is not running (grows up to 4x)."
					},
					"Translation": {
						"Text": "Seconds between reconnect attempts while MacroHub is not running (grows up to 4x)."
					},
					"Key": "MacroKeyboardSettings:ReconnectSeconds"
				},
				{
					"Source": {
						"Text": "Send a keyboard shortcut inside Unreal (Slate routing, not the operating system)."
					},
					"Translation": {
						"Text": "Send a keyboard shortcut inside Unreal (Slate routing, not the operating system)."
					},
					"Key": "EMacroEditorAction.Chord"
				},
				{
					"Source": {
						"Text": "Shortcut to send (Action = Chord)."
					},
					"Translation": {
						"Text": "Shortcut to send (Action = Chord)."
					},
					"Key": "MacroKeyboardBinding:Chord"
				},
				{
					"Source": {
						"Text": "Sub-part of a knob/joystick: cw, ccw, press, up, down, left, right."
					},
					"Translation": {
						"Text": "Sub-part of a knob/joystick: cw, ccw, press, up, down, left, right."
					},
					"Key": "MacroControlEvent:Part"
				},
				{
					"Source": {
						"Text": "Sub-part of a knob/joystick: cw, ccw, press, up, down, left, right."
					},
					"Translation": {
						"Text": "Sub-part of a knob/joystick: cw, ccw, press, up, down, left, right."
					},
					"Key": "MacroControlInfo:Part"
				},
				{
					"Source": {
						"Text": "What a control does in a given editor context."
					},
					"Translation": {
						"Text": "What a control does in a given editor context."
					},
					"Key": "EMacroEditorAction"
				},
				{
					"Source": {
						"Text": "Write every control the editor acts on to the Output Log (\"KNOB_CW [sequencer] -> timeline scrub…\").\nOff by default; the same lines stay available at Verbose (`log LogMacroKeyboard Verbose`)."
					},
					"Translation": {
						"Text": "Write every control the editor acts on to the Output Log (\"KNOB_CW [sequencer] -> timeline scrub…\").\nOff by default; the same lines stay available at Verbose (`log LogMacroKeyboard Verbose`)."
					},
					"Key": "MacroKeyboardEditorSettings:bLogControlEvents"
				},
				{
					"Source": {
						"Text": "Write every raw control event received from MacroHub to the Output Log (\"KNOB_CW down (knob/cw seq=…)\").\nOff by default. What the editor then does with each event has its own switch in Editor Preferences →\nPlugins → MacroKeyboard (Editor) → Diagnostics."
					},
					"Translation": {
						"Text": "Write every raw control event received from MacroHub to the Output Log (\"KNOB_CW down (knob/cw seq=…)\").\nOff by default. What the editor then does with each event has its own switch in Editor Preferences →\nPlugins → MacroKeyboard (Editor) → Diagnostics."
					},
					"Key": "MacroKeyboardSettings:bLogEvents"
				}
			]
		}
	]
}